Revit 2027 API
ParameterTypeId.AssemblyNamingCategory Property
 "Naming Category"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AssemblyNamingCategory { get; }
Public Shared ReadOnly Property AssemblyNamingCategory As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AssemblyNamingCategory {
	ForgeTypeId^ get ();
}
static member AssemblyNamingCategory : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace